{
  "Convertible": {
    "name": "MINI Convertible",
    "productionYears": [2021,2022],
    "bodyStyle": " Convertible (spider/spyder, cabrio/cabriolet, drop/open/soft top)",
    "info": "Building a convertible was a must for MINI. It always had one on its lineup, and the 2021 range came with one as well. Unlike some of its previous generations, it came right from the start with the S-version, which means that the open-top small vehicle was able to punch and offer some good sensations behind the wheel.\n\nFrom the outside, the new MINI Cooper Convertible shared the same front fascia with the rest of the range with the specific Cooper S air-scoops for that version. That included the piano-black trim around the grille and the horizontal bar for the license plate. It even sported that slat even for the U.S. market, where it was not required. But the carmaker added it anyway. Its strong, thick, slightly raked A-pillars served as safety arches. Unlike some of its predecessors, it didn't feature any other visible roll-over protection behind the rear seats. Instead, it showed the retractable roof, which couldn't be completely hidden behind the cabin.\n\nInside, the Cooper Convertible received a 5\" instrument cluster fitted as standard. An 8.8\" touch-screen dominated the center stack's top. MINI installed sport-bucket seats with high-bolstering for the sportier versions. The carmaker kept the same design for the steering wheel with three thick spokes and added buttons on the horizontal ones. Like on its predecessors, to access the rear seats, the front ones had to be tilted and slid forward. At least, there was no roof above to make the access difficult.",
    "engines": [
      "Cooper 1.5L 6MT (136 HP)",
      "Cooper S 2.0L 6MT (178 HP)",
      "John Cooper Works 8AT (102 HP)",
      "John Cooper Works 8AT (178 HP)",
      "John Cooper Works 8AT (231 HP)"
    ],
    "images": [
      "convertible1.jpg",
      "convertible2.jpg",
      "convertible3.jpg"
    ]
  },
  "3-door": {
    "name": "MINI Mini Cooper 3-door",
    "productionYears": [2021,2022],
    "bodyStyle": "Hatchback",
    "info": "In 2021, MINI already reached its fourth generation and came full-power in a few versions: three doors, five doors, and the convertible. That refresh was mandatory; hence there were new emission regulations in Europe, and the carmaker tried to stay on top of its game and offer the best products in the segment.\n\nIt is hard for a designer to make a nearly identical, yet different, vehicle. The MINI's shape was everyone's vanilla, and it had to stay that way. For the 2021 model, a piano-black surrounding emphasized the grille area, while a fat horizontal bar sported the license plate. In the rear, the Union Jack appeared on the taillights. The MINI sported a unique multi-tone roof.\n\nInside, MINI received a big display instead of its regular dials in the instrument cluster. The touch-screen on the center stack was already offered as an option from the third generation. Its front sport-bucket seats featured high-bolstering. The carmaker kept the same design for the steering wheel with three thick spokes and added buttons on the horizontal ones. Like on its predecessors, to access the rear seats, the front ones had to be tilted and slid forward.\n\nUnder the hood, MINI offered the three-door version with a choice of three engines, apart from the electric version. The carmaker completely removed the diesel versions from the lineup.",
    "engines": [
      "Cooper 1.5L 6MT (136 HP)",
      "Cooper One 1.5L 6MT (102 HP)",
      "Cooper S 1.5L 6MT (178 HP)",
      "John Cooper Works 2.0L 6MT (231 HP)",
      "John Cooper Works 2.0L 8AT (231 HP)",
      "John Cooper Works GP 8AT (306 HP)"
    ],
    "images": [
      "3door1.jpg",
      "3door2.jpg",
      "3door3.jpg"
    ]
  },
  "Countryman": {
    "name": "MINI Countryman",
    "productionYears": [2020,2021,2022],
    "bodyStyle": "Hatchback",
    "info": "Despite being a crossover, the Countryman still resembled some details connected to the original MINI. Apart from the headlights and the “fridge-doors” in the back, it offered new possibilities for its owners.\n\nThere were just a few details that could tell the difference between the 2017 and the facelifted, 2020, model. On the front, the LED headlights were fitted as standard and not an option for the non-facelifted model. An adaptive headlight system was on the options list. The rear apron was redesigned in the back, and the taillights showed a brighter Union Jack light thanks to the LED system. A distinctive aerodynamic package enhanced the sportier look of the Cooper version.\n\nWhile most of the range showed a stylish design, the Countryman featured a more practical approach. For instance, it was available with a bigger trunk and split-fold 40:20:40 rear bench. With all seats folded, the total luggage volume was increased from 450 liters (15.9 cu-ft) up to 1390 liters (49 cu-ft). The MINI Cooper S Countryman, MINI Cooper SD Countryman, and MINI Cooper SE Countryman ALL4 models were featured as standard Piano Black interior surfaces for the cockpit and door bezels.\n\nUnder the hood, MINI offered Euro 6d engines only, and some versions were available with automatic transmissions only. The plug-in hybrid version received a bigger battery pack for better fuel-efficiency.",
    "engines": [
      "Cooper 1.5L 6MT (136 HP)",
      "Cooper 1.5L 7AT (136 HP)",
      "Cooper ALL4 1.5L 8AT (136 HP)",
      "Cooper S 2.0L 6MT (178 HP)",
      "Cooper S 2.0L 7AT (178 HP)",
      "Cooper S ALL4 2.0L 8AT (178 HP)",
      "John Cooper Works 2.0L 8AT (306 HP)"
    ],
    "images": [
      "countryman1.jpg",
      "countryman2.jpg",
      "countryman3.jpg"
    ]
  },
  "Clubman": {
    "name": "MINI Clubman",
    "productionYears": [2019,2020,2021,2022],
    "bodyStyle": "Van",
    "info": "MINI is the only premium brand that is building only small class vehicles. The carmaker evolved from one product to an entire range of small vehicles, which includes everything from three-door hatchbacks to models like the latest Clubman, which is a four-door hatchback. But it is a four-door in an unusual way.\n\nIn the company's history there was a model back in the days that was intended to be used as a delivery car. Some sort of small MPV but in a British style and it was called the Clubman. The name remained, but its destination changed. Now it is a fancy car with two doors on each side and a swing-out double-door on the rear. This makes it the only hatchback with six doors on the market.\n\nThe new Clubman will have three or four-cylinder engines, FWD or AWD, paired with either a 6-speed manual transmission or an automatic transmission with 7 or 8 gears, depending on the engine. The base model is offered with only 106 HP, but the top version, the Clubman John Cooper Works has 306 HP and is AWD.\n\nInside, the main theme revolves around style, glamor and fancy options, such as the infotainment system that allows Android Auto and Apple CarPlay with the touchscreen on the center console.",
    "engines": [
      "Cooper 1.5L 6MT (136 HP)",
      "Cooper S 2.0L 7AT (192 HP)",
      "Cooper S ALL4 2.0L 7AT (192 HP)",
      "John Cooper Works 2.0L 6MT (231 HP))",
      "John Cooper Works 2.0L 8AT (231 HP)",
      "John Cooper Works 2.0L 8AT (306 HP)",
      "One 1.5L 7AT (102 HP)"
    ],
    "images": [
      "clubman1.jpg",
      "clubman2.jpg",
      "clubman3.jpg"
    ]
  },
  "Clubvan": {
    "name": "MINI Clubvan",
    "productionYears": [2012, 2013, 2014, 2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022],
    "bodyStyle": "Hatchback",
    "info": "The 2012 MINI Clubvan was one of the rarest MINI ever made. It was designed for those who needed a van but in a more exquisite form. It might be called a “premium, small-class, utility van”.\n\nThe Clubvan was unveiled as a Concept Car at 2012 Geneva Motor Show and the pre-series model showed up at the Goodwood Festival of Speed in the same year. Production models started in late 2012 and further models were produced in 2013. After only 50 models have been sold in the U.S., the car was axed from the production line.\n\nThe Clubvan was a Clubman with vinyl wraps over its side windows and plastic covers inside to protect the glass for breaking. It was the cheapest production method for the Clubvan, a vehicle that was actually a converted Clubman. It even kept the side rear small door, but it was useless. It was there just to ease the production line. Moreover, the interior rear grab-handles, which were useful for rear passengers, were kept in place. The front seats retained the folding mechanism that was used to allow access for the rear seats.\n\nThe instrument cluster and the dashboard were the same as in any other MINI Clubman. The car was ideal especially for MINI service-shops and for luxury deliveries since its price was particularly high.\n\nBack in the '50s, an economic debate between Europe and the U.S. led to an increase in taxation for the chickens imported in Europe from the U.S. In retaliation, the U.S. Government imposed a 25% tax for imported utility vans and pickups from Europe. That law was still in existence in 2013 and thus, the MINI Clubvan was more expensive than a MINI Clubman, and from most of the vans.",
    "engines": [
      "Cooper 1.6",
      "One 1.4"
    ],
    "images": [
      "clubvan1.jpg",
      "clubvan2.jpg",
      "clubvan3.jpg"
    ]
  }
}